In [1]:
import sys
import os
sys.path.append(os.path.abspath("../src"))

import datetime as dt
import numpy as np
import pandas as pd
pd.set_option('display.max_rows', 100)

from etl import quarter_to_dt

## Methodology:

I will clean and transform each dataframe separated by question, so for the first question I will verify and make the transformations needed in the related dataframes, and the same for the remaining questions.

**QUESTION 1.** Which economic sectors have experienced the highest growth since 2010, and how did the COVID-19 pandemic shift their trajectories?  
**Related dataframes**: QLF03, QLF05, QLF07, QLF32, QES01, QES03

In [2]:
# quick visualization of each df
q1_related = ['QLF03', 
              'QLF05', 
              'QLF07']
# deleted from the related QES01, QES03, QLF32 because of the lack of info compared to the others
# will delete QLF05, QLF07 because of the inconsistency of what makes an "adult"
# checked if the total (all region, sex and sector) for QLF03 and QLF05 + QLF07, and returned different numbers (27.1 difference)
# decided to go with QLF03, cause it provide the exact data that I need

for df in q1_related:
    df_v = pd.read_csv(f'../data/raw/{df}.csv')

    print(f'{df} Dataframe')
    display(df_v.head(3))
    print('-------------------')

QLF03 Dataframe

,Statistic,Quarter,Sex,NACE Rev 2 Economic Sector,value
0,Persons aged 15-89 years in Employment,1998Q1,Both sexes,All NACE economic sectors,1550.3
1,Persons aged 15-89 years in Employment,1998Q1,Both sexes,"Agriculture, forestry and fishing (A)",135.6
2,Persons aged 15-89 years in Employment,1998Q1,Both sexes,Construction (F),103.7

-------------------
QLF05 Dataframe

,Statistic,Sex,NACE Rev 2 Economic Sector,Region,Quarter,value
0,Person aged 15 years and over in Employment,Both sexes,All NACE economic sectors,State,1998Q1,1550.4
1,Person aged 15 years and over in Employment,Both sexes,All NACE economic sectors,State,1998Q2,1572.1
2,Person aged 15 years and over in Employment,Both sexes,All NACE economic sectors,State,1998Q3,1636.3

-------------------
QLF07 Dataframe

,STATISTIC,Quarter,Sex,NACE Rev 2 Economic Sector,Region,value
0,Persons aged 15-89 years in Employment,2012Q1,Both sexes,All NACE economic sectors,State,1862.6
1,Persons aged 15-89 years in Employment,2012Q1,Both sexes,All NACE economic sectors,Border,145.1
2,Persons aged 15-89 years in Employment,2012Q1,Both sexes,All NACE economic sectors,West,175.8

-------------------

In [3]:
# Transforming the Quarter column from string to datetime
df_qlf03 = pd.read_csv(f'../data/raw/QLF03.csv')
quarter_to_dt(df_qlf03)

**QUESTION 2. How has foreign workforce participation evolved in Ireland since the early 2000s?**

In [4]:
# quick visualization of each df
q2_related = ['QLF34', 'QLF35', 'QLF47', 'QLF48']

# can use all of those dataframes, being QLF34/QLF47 for explaining how much more people from outside work
# QLF34/QLF47 to show which sectors most employ foreigners

for df in q2_related:
    df_v = pd.read_csv(f'../data/raw/{df}.csv')

    print(f'{df} Dataframe')
    display(df_v.head(3))
    print('-------------------')

QLF34 Dataframe

,STATISTIC,Quarter,Nationality,NACE Rev 2 Economic Sector,value
0,Persons aged 15 years and over in Employment,1998Q1,All nationalities,All NACE economic sectors,1550.3
1,Persons aged 15 years and over in Employment,1998Q1,All nationalities,"Agriculture, forestry and fishing (A)",135.6
2,Persons aged 15 years and over in Employment,1998Q1,All nationalities,Construction (F),103.7

-------------------
QLF35 Dataframe

,STATISTIC,Quarter,Nationality,ILO Economic Status,value
0,Persons aged 15 years and over,1998Q1,All nationalities,All ILO economic status,2857.2
1,Persons aged 15 years and over,1998Q1,All nationalities,In labour force,1699.0
2,Persons aged 15 years and over,1998Q1,All nationalities,In employment,1550.3

-------------------
QLF47 Dataframe

,Statistic,Quarter,NACE Rev 2 Economic Sector,Citizenship,value
0,Persons aged 15 years and over in Employment,2021Q1,All NACE economic sectors,All Countries,2259.9
1,Persons aged 15 years and over in Employment,2021Q1,All NACE economic sectors,EU14 excl Irl (countries in the EU pre 2004 ex...,60.7
2,Persons aged 15 years and over in Employment,2021Q1,All NACE economic sectors,EU15 to EU27 (accession countries joined post ...,137.1

-------------------
QLF48 Dataframe

,Statistic,Quarter,ILO Economic Status,Citizenship,value
0,Persons aged 15 years and over,2021Q1,All ILO economic status,All Countries,4056.3
1,Persons aged 15 years and over,2021Q1,All ILO economic status,EU14 excl Irl (countries in the EU pre 2004 ex...,80.9
2,Persons aged 15 years and over,2021Q1,All ILO economic status,EU15 to EU27 (accession countries joined post ...,207.1

-------------------

In [5]:
df_qlf34 = pd.read_csv(f'../data/raw/QLF34.csv')
quarter_to_dt(df_qlf34)

df_qlf35 = pd.read_csv(f'../data/raw/QLF35.csv')
quarter_to_dt(df_qlf35)

df_qlf47 = pd.read_csv(f'../data/raw/QLF47.csv')
quarter_to_dt(df_qlf47)

df_qlf48 = pd.read_csv(f'../data/raw/QLF48.csv')
quarter_to_dt(df_qlf48)

In [6]:
# dictionary for each nationality in QLF34 and QLF35, all of them being mutually exclusive
natio_dict = {'EU14 excl Irl (countries in the EU pre 2004 excluding UK & Ireland)': 'EU14',
              'EU15 to EU27 (accession countries joined post 2004)': 'EU15-27',
              'UK': 'UK',
              'Irish' : 'Irish',
              'Other nationalities (7)': 'Non-EU'}

# dictionary for each citizenship in QLF47 and QLF48
citi_dict = {'EU14 excl Irl (countries in the EU pre 2004 excluding UK & Ireland)': 'EU14',
             'EU15 to EU27 (accession countries joined post 2004)': 'EU15-27',
             'United Kingdom': 'UK',
             'Ireland' : 'Irish',
             'All countries excluding Ireland,United Kingdom and EU272020': 'Non-EU'}

In [7]:
df_qlf47.rename(columns={'Citizenship': 'Nationality'},
                         inplace=True)
df_qlf48.rename(columns={'Citizenship': 'Nationality'}, 
                         inplace=True)

In [8]:
q2_dataframes = [df_qlf34, df_qlf35, df_qlf47, df_qlf48]

In [9]:
# renaming the nationality and citizenship columns in data to merge them later
for df in q2_dataframes:
    if df is df_qlf34 or df is df_qlf35:
        df['Nationality'] = df['Nationality'].map(natio_dict)
    else:
        df['Nationality'] = df['Nationality'].map(citi_dict)

    df.drop(df[df['Nationality'].isnull()].index, inplace=True)
    df.reset_index(drop=True, inplace=True)

    df.columns = df.columns.map(lambda x: x.lower().replace(' ', '_'))

#df_qlf34['Nationality'] = df_qlf34['Nationality'].map(natio_dict)
#df_qlf35['Nationality'] = df_qlf35['Nationality'].map(natio_dict)
#df_qlf47['Nationality'] = df_qlf47['Nationality'].map(citi_dict)
#df_qlf48['Nationality'] = df_qlf48['Nationality'].map(citi_dict)

#df.drop(df[df['Nationality'].isnull()].index, inplace=True)
#df.reset_index(drop=True,
#                     inplace=True)

In [10]:
# ordering the dataframes based on the ones they will concatenate
df_qlf47 = df_qlf47[df_qlf34.columns]
df_qlf48 = df_qlf48[df_qlf35.columns]

In [11]:
q2_dataframes = [df_qlf34, df_qlf35, df_qlf47, df_qlf48]

for df in q2_dataframes:
    df_v = df

    display(df_v.head(3))
    print('-------------------')

,statistic,quarter,nationality,nace_rev_2_economic_sector,value,period,date
0,Persons aged 15 years and over in Employment,1998Q1,EU14,All NACE economic sectors,7.0,1998Q1,1998-01-01
1,Persons aged 15 years and over in Employment,1998Q1,EU14,"Agriculture, forestry and fishing (A)",NaN,1998Q1,1998-01-01
2,Persons aged 15 years and over in Employment,1998Q1,EU14,Construction (F),NaN,1998Q1,1998-01-01

-------------------

,statistic,quarter,nationality,ilo_economic_status,value,period,date
0,Persons aged 15 years and over,1998Q1,EU14,All ILO economic status,10.5,1998Q1,1998-01-01
1,Persons aged 15 years and over,1998Q1,EU14,In labour force,7.5,1998Q1,1998-01-01
2,Persons aged 15 years and over,1998Q1,EU14,In employment,7.0,1998Q1,1998-01-01

-------------------

,statistic,quarter,nationality,nace_rev_2_economic_sector,value,period,date
0,Persons aged 15 years and over in Employment,2021Q1,EU14,All NACE economic sectors,60.7,2021Q1,2021-01-01
1,Persons aged 15 years and over in Employment,2021Q1,EU15-27,All NACE economic sectors,137.1,2021Q1,2021-01-01
2,Persons aged 15 years and over in Employment,2021Q1,UK,All NACE economic sectors,46.4,2021Q1,2021-01-01

-------------------

,statistic,quarter,nationality,ilo_economic_status,value,period,date
0,Persons aged 15 years and over,2021Q1,EU14,All ILO economic status,80.9,2021Q1,2021-01-01
1,Persons aged 15 years and over,2021Q1,EU15-27,All ILO economic status,207.1,2021Q1,2021-01-01
2,Persons aged 15 years and over,2021Q1,UK,All ILO economic status,91.3,2021Q1,2021-01-01

-------------------

In [12]:
# concatenating the dataframes that will be used for answering the question 2
df_q2 = pd.concat([df_qlf35, df_qlf48], ignore_index=True).sort_values(by=['quarter', 'nationality', 'ilo_economic_status'], ascending=True)
df_q2extra = pd.concat([df_qlf34, df_qlf47], ignore_index=True).sort_values(by=['quarter', 'nationality', 'nace_rev_2_economic_sector'], ascending=True)

**QUESTION 3. How has the balance between Full-time and Part-time employment shifted over time?**

In [13]:
# I will use QES06 for answering this question

df_q3 = pd.read_csv('../data/raw/QES06.csv')

df_q3.columns = df_q3.columns.map(lambda x: x.lower().replace(' ', '_'))

df_q3

,statistic,quarterly,full_and_part_time_status,nace_rev_2_economic_sector,value
0,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,All NACE economic sectors,1550.3
1,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,"Agriculture, forestry and fishing (A)",135.6
2,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,Construction (F),103.7
3,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,Wholesale and retail trade; repair of motor ve...,219.5
4,Persons aged 15 years and over in Employment (...,1998Q1,All employment status,Transportation and storage (H),65.6
...,...,...,...,...,...
5881,Persons aged 15 years and over in Employment (...,2025Q1,Part-time,"Financial, insurance and real estate activitie...",13.6
5882,Persons aged 15 years and over in Employment (...,2025Q1,Part-time,Other NACE activities (R to U),50.1
5883,Persons aged 15 years and over in Employment (...,2025Q1,Part-time,Industry and Construction (B to F),38.8
5884,Persons aged 15 years and over in Employment (...,2025Q1,Part-time,Services (G to U),527.2
5885,Persons aged 15 years and over in Employment (...,2025Q1,Part-time,Not stated,NaN

**QUESTION 4: How have remote and hybrid work models expanded across Ireland over the past five years?**

In [14]:
# quick visualization of each df
q4_related = ['QES20', 'QES21']

# Will use only QES21 cause it is where we start to having people stating if they work at home or not
# and it gives us the information of the region

for df in q4_related:
    df_v = pd.read_csv(f'../data/raw/{df}.csv')

    print(f'{df} Dataframe')
    display(df_v)
    print('-------------------')

QES20 Dataframe

,Statistic,Quarter,Extent of working at home,value
0,Persons aged 15 years and over in employment (...,1998Q1,Person usually works at home,NaN
1,Persons aged 15 years and over in employment (...,1998Q1,Person sometimes works at home,NaN
2,Persons aged 15 years and over in employment (...,1998Q1,Person never works at home,NaN
3,Persons aged 15 years and over in employment (...,1998Q1,Not stated,1550.3
4,Persons aged 15 years and over in employment (...,1998Q1,All persons in employment,1550.3
...,...,...,...,...
540,Persons aged 15 years and over in employment (...,2025Q1,Person usually works at home,554.5
541,Persons aged 15 years and over in employment (...,2025Q1,Person sometimes works at home,480.4
542,Persons aged 15 years and over in employment (...,2025Q1,Person never works at home,1749.6
543,Persons aged 15 years and over in employment (...,2025Q1,Not stated,9.6
544,Persons aged 15 years and over in employment (...,2025Q1,All persons in employment,2794.1

-------------------
QES21 Dataframe

,Statistic,Quarter,NUTS3 regions,Extent of working at home,value
0,Persons aged 15 years and over in employment (...,2001Q1,Border,Person usually works at home,27.1
1,Persons aged 15 years and over in employment (...,2001Q1,Border,Person sometimes works at home,17.1
2,Persons aged 15 years and over in employment (...,2001Q1,Border,Person never works at home,142.3
3,Persons aged 15 years and over in employment (...,2001Q1,Border,Not stated,4.6
4,Persons aged 15 years and over in employment (...,2001Q1,Border,All persons in employment,191.1
...,...,...,...,...,...
8725,Proportion of total persons aged 15 years and ...,2025Q1,Ireland,Person usually works at home,19.8
8726,Proportion of total persons aged 15 years and ...,2025Q1,Ireland,Person sometimes works at home,17.2
8727,Proportion of total persons aged 15 years and ...,2025Q1,Ireland,Person never works at home,62.6
8728,Proportion of total persons aged 15 years and ...,2025Q1,Ireland,Not stated,0.3
8729,Proportion of total persons aged 15 years and ...,2025Q1,Ireland,All persons in employment,100.0

-------------------

In [15]:
df_q4 = pd.read_csv('../data/raw/QES21.csv')

df_q4.columns = df_q4.columns.map(lambda x: x.lower().replace(' ', '_'))

df_q4

,statistic,quarter,nuts3_regions,extent_of_working_at_home,value
0,Persons aged 15 years and over in employment (...,2001Q1,Border,Person usually works at home,27.1
1,Persons aged 15 years and over in employment (...,2001Q1,Border,Person sometimes works at home,17.1
2,Persons aged 15 years and over in employment (...,2001Q1,Border,Person never works at home,142.3
3,Persons aged 15 years and over in employment (...,2001Q1,Border,Not stated,4.6
4,Persons aged 15 years and over in employment (...,2001Q1,Border,All persons in employment,191.1
...,...,...,...,...,...
8725,Proportion of total persons aged 15 years and ...,2025Q1,Ireland,Person usually works at home,19.8
8726,Proportion of total persons aged 15 years and ...,2025Q1,Ireland,Person sometimes works at home,17.2
8727,Proportion of total persons aged 15 years and ...,2025Q1,Ireland,Person never works at home,62.6
8728,Proportion of total persons aged 15 years and ...,2025Q1,Ireland,Not stated,0.3
8729,Proportion of total persons aged 15 years and ...,2025Q1,Ireland,All persons in employment,100.0

**QUESTION 5. How has job tenure changed across sectors in Ireland over time?**

In [16]:
df_q5 = pd.read_csv('../data/raw/QES15.csv')

df_q5.columns = df_q5.columns.map(lambda x: x.lower().replace(' ', '_'))

df_q5

,statistic,quarter,permanency_of_employment,nace_rev_2_economic_sector,value
0,Employees aged 15 years and over in Employment...,1998Q1,All employees,All NACE economic sectors,1242.9
1,Employees aged 15 years and over in Employment...,1998Q1,All employees,"Agriculture, forestry and fishing (A)",24.4
2,Employees aged 15 years and over in Employment...,1998Q1,All employees,Construction (F),75.1
3,Employees aged 15 years and over in Employment...,1998Q1,All employees,Wholesale and retail trade; repair of motor ve...,175.7
4,Employees aged 15 years and over in Employment...,1998Q1,All employees,Transportation and storage (H),51.0
...,...,...,...,...,...
7843,Employees aged 15 years and over in Employment...,2025Q1,Not stated,"Financial, insurance and real estate activitie...",NaN
7844,Employees aged 15 years and over in Employment...,2025Q1,Not stated,Other NACE activities (R to U),NaN
7845,Employees aged 15 years and over in Employment...,2025Q1,Not stated,Industry and Construction (B to F),NaN
7846,Employees aged 15 years and over in Employment...,2025Q1,Not stated,Services (G to U),10.6
7847,Employees aged 15 years and over in Employment...,2025Q1,Not stated,Not stated,NaN

**6. Which gender consistently faces higher unemployment in Ireland, and has this gap narrowed over time?**

In [17]:
# I could use QLF18 but I will use only QLF01 for the sake of answering this question
df_q6 = pd.read_csv('../data/raw/QLF01.csv')

df_q6.columns = df_q6.columns.map(lambda x: x.lower().replace(' ', '_'))

df_q6

,statistic,quarter,sex,ilo_economic_status,value
0,Persons aged 15 years and over,1998Q1,Both sexes,All ILO economic status,2857.2
1,Persons aged 15 years and over,1998Q1,Both sexes,In labour force,1699.0
2,Persons aged 15 years and over,1998Q1,Both sexes,In employment,1550.3
3,Persons aged 15 years and over,1998Q1,Both sexes,In employment full-time,1282.6
4,Persons aged 15 years and over,1998Q1,Both sexes,In employment part-time,267.7
...,...,...,...,...,...
4573,Persons aged 15 years and over,2025Q1,Female,Unemployed seeking part-time work,25.5
4574,Persons aged 15 years and over,2025Q1,Female,Not in labour force,874.4
4575,Persons aged 15 years and over,2025Q1,Female,Potential additional labour force,64.5
4576,Persons aged 15 years and over,2025Q1,Female,Others not in labour force,809.9
4577,Persons aged 15 years and over,2025Q1,Female,Unemployed seeking work as self-employed,NaN

**QUESTION 7. How does marital status affect labour force participation in Ireland? ## How does marital status influence unemployment trends in Ireland?**

In [18]:
df_q7 = pd.read_csv('../data/raw/QLF28.csv')

df_q7.columns = df_q7.columns.map(lambda x: x.lower().replace(' ', '_'))

df_q7

,statistic,quarter,age_group,sex,marital_status,value
0,ILO Participation Rates (%),1998Q1,15 - 19 years,Both sexes,Single - never married,40.8
1,ILO Participation Rates (%),1998Q1,15 - 19 years,Both sexes,Married,NaN
2,ILO Participation Rates (%),1998Q1,15 - 19 years,Both sexes,Widowed,NaN
3,ILO Participation Rates (%),1998Q1,15 - 19 years,Both sexes,Separated or divorced,NaN
4,ILO Participation Rates (%),1998Q1,15 - 19 years,Both sexes,All marital status,40.8
...,...,...,...,...,...,...
14710,ILO Participation Rates (%),2025Q1,65 years and over,Female,Single - never married,9.0
14711,ILO Participation Rates (%),2025Q1,65 years and over,Female,Married,9.8
14712,ILO Participation Rates (%),2025Q1,65 years and over,Female,Widowed,5.6
14713,ILO Participation Rates (%),2025Q1,65 years and over,Female,Separated or divorced,13.3
14714,ILO Participation Rates (%),2025Q1,65 years and over,Female,All marital status,8.7

**QUESTION 8. How does age correlate with employment status across different stages of life?**

In [19]:
df_q8 = pd.read_csv('../data/raw/QLF18.csv')

df_q8.columns = df_q8.columns.map(lambda x: x.lower().replace(' ', '_'))

df_q8

,statistic,quarter,age_group,sex,value
0,Person aged 15 years and over in the Labour Force,1998Q1,15 - 19 years,Both sexes,140.2
1,Person aged 15 years and over in the Labour Force,1998Q1,15 - 19 years,Male,83.8
2,Person aged 15 years and over in the Labour Force,1998Q1,15 - 19 years,Female,56.4
3,Person aged 15 years and over in the Labour Force,1998Q1,15 - 24 years,Both sexes,389.8
4,Person aged 15 years and over in the Labour Force,1998Q1,15 - 24 years,Male,215.1
...,...,...,...,...,...
25501,ILO Unemployment Rates (15 - 74 years),2025Q1,65 years and over,Male,1.3
25502,ILO Unemployment Rates (15 - 74 years),2025Q1,65 years and over,Female,2.6
25503,ILO Unemployment Rates (15 - 74 years),2025Q1,25 - 74 years,Both sexes,3.6
25504,ILO Unemployment Rates (15 - 74 years),2025Q1,25 - 74 years,Male,3.7
25505,ILO Unemployment Rates (15 - 74 years),2025Q1,25 - 74 years,Female,3.4

**QUESTION 9. What are the dominant employment sectors for students, and how do they differ from the general population? ## Do students experience higher unemployment rates compared to non-students?**

In [20]:
df_q9 = pd.read_csv('../data/raw/QES22.csv')

df_q9.columns = df_q9.columns.map(lambda x: x.lower().replace(' ', '_'))

df_q9

,statistic,quarter,nace_rev_2_economic_sector,value
0,Students aged 15 years and over in employment ...,1998Q1,All NACE economic sectors,54.1
1,Students aged 15 years and over in employment ...,1998Q1,"Agriculture, forestry and fishing (A)",3.0
2,Students aged 15 years and over in employment ...,1998Q1,Construction (F),NaN
3,Students aged 15 years and over in employment ...,1998Q1,Wholesale and retail trade; repair of motor ve...,21.8
4,Students aged 15 years and over in employment ...,1998Q1,Transportation and storage (H),NaN
...,...,...,...,...
3919,Proportion of total students in employment (PES),2025Q1,"Financial, insurance and real estate activitie...",NaN
3920,Proportion of total students in employment (PES),2025Q1,Other NACE activities (R to U),8.9
3921,Proportion of total students in employment (PES),2025Q1,Industry and Construction (B to F),4.8
3922,Proportion of total students in employment (PES),2025Q1,Services (G to U),91.1
3923,Proportion of total students in employment (PES),2025Q1,Not stated,NaN

**QUESTION 10. In which sectors are students most employed today, and how does this differ from pre-pandemic patterns?**

This is answered by the same dataset as Question 9

**QUESTION 11. Which Irish regions have experienced the fastest Labour Force growth over the past decade?**

In [24]:
q11_related = ['QLF08', 'QLF15']

# For this one I will use only QLF08 alongside QLF15, cause then I will have a dataset
# that will answer both question 11 and 12

for df in q11_related:
    df_v = pd.read_csv(f'../data/raw/{df}.csv')

    print(f'{df} Dataframe')
    display(df_v)
    print('-------------------')

QLF08 Dataframe

,Statistic,Quarter,Region,value
0,Persons aged 15 years and over in Employment,2012Q1,State,1862.6
1,Persons aged 15 years and over in Employment,2012Q1,Northern and Western,320.9
2,Persons aged 15 years and over in Employment,2012Q1,Border,145.1
3,Persons aged 15 years and over in Employment,2012Q1,West,175.8
4,Persons aged 15 years and over in Employment,2012Q1,Southern,618.7
...,...,...,...,...
3175,ILO Participation Rate (15 years and over),2025Q1,South-West,65.1
3176,ILO Participation Rate (15 years and over),2025Q1,Eastern and Midland,67.5
3177,ILO Participation Rate (15 years and over),2025Q1,Dublin,68.9
3178,ILO Participation Rate (15 years and over),2025Q1,Mid-East,67.0
3179,ILO Participation Rate (15 years and over),2025Q1,Midland,61.9

-------------------
QLF15 Dataframe

,NUTS 3 Regions,Quarter,Statistic,value
0,State,1998Q1,Persons aged 15 years and over in Employment (...,1550.4
1,State,1998Q1,Unemployed Persons aged 15 years and over (Tho...,150.5
2,State,1998Q1,Persons aged 15 years and over in Labour Force...,1700.9
3,State,1998Q1,ILO Unemployment Rate (15 - 74 years) (%),8.9
4,State,1998Q1,ILO Participation Rate (15 years and over) (%),59.5
...,...,...,...,...
2515,South-West,2011Q4,Persons aged 15 years and over in Employment (...,278.9
2516,South-West,2011Q4,Unemployed Persons aged 15 years and over (Tho...,47.5
2517,South-West,2011Q4,Persons aged 15 years and over in Labour Force...,326.4
2518,South-West,2011Q4,ILO Unemployment Rate (15 - 74 years) (%),14.6
2519,South-West,2011Q4,ILO Participation Rate (15 years and over) (%),62.1

-------------------

In [25]:
df_qlf08 = pd.read_csv(f'../data/raw/QLF08.csv')
df_qlf15 = pd.read_csv(f'../data/raw/QLF15.csv')

print(df_qlf08['Region'].value_counts())
print(df_qlf15['NUTS 3 Regions'].value_counts())

# state, border, west, mid-west, mid-east, midland, south-east, south-west, mid-west, dublin
# northern and western, eastern and midland, southern

Region
State                   265
Northern and Western    265
Border                  265
West                    265
Southern                265
Mid-West                265
South-East              265
South-West              265
Eastern and Midland     265
Dublin                  265
Mid-East                265
Midland                 265
Name: count, dtype: int64
NUTS 3 Regions
State         280
Border        280
Midland       280
West          280
Dublin        280
Mid-East      280
Mid-West      280
South-East    280
South-West    280
Name: count, dtype: int64

In [34]:
display(df_qlf08.loc[(df_qlf08['Region'] == 'Northern and Western') & (df_qlf08['Statistic'] == 'Persons aged 15 years and over in Employment')].head())
display(df_qlf08.loc[(df_qlf08['Region'] == 'Border') & (df_qlf08['Statistic'] == 'Persons aged 15 years and over in Employment')].head())
display(df_qlf08.loc[(df_qlf08['Region'] == 'West') & (df_qlf08['Statistic'] == 'Persons aged 15 years and over in Employment')].head())

,Statistic,Quarter,Region,value
1,Persons aged 15 years and over in Employment,2012Q1,Northern and Western,320.9
13,Persons aged 15 years and over in Employment,2012Q2,Northern and Western,325.0
25,Persons aged 15 years and over in Employment,2012Q3,Northern and Western,327.7
37,Persons aged 15 years and over in Employment,2012Q4,Northern and Western,327.3
49,Persons aged 15 years and over in Employment,2013Q1,Northern and Western,334.9

                                       Statistic Quarter  Region  value
2   Persons aged 15 years and over in Employment  2012Q1  Border  145.1
14  Persons aged 15 years and over in Employment  2012Q2  Border  146.5
26  Persons aged 15 years and over in Employment  2012Q3  Border  145.7
38  Persons aged 15 years and over in Employment  2012Q4  Border  148.1
50  Persons aged 15 years and over in Employment  2013Q1  Border  151.6

                                       Statistic Quarter Region  value
3   Persons aged 15 years and over in Employment  2012Q1   West  175.8
15  Persons aged 15 years and over in Employment  2012Q2   West  178.5
27  Persons aged 15 years and over in Employment  2012Q3   West  182.0
39  Persons aged 15 years and over in Employment  2012Q4   West  179.3
51  Persons aged 15 years and over in Employment  2013Q1   West  183.3

In [ ]:
# EXCLUDE THE NON NUTS 3 REGIONS FROM THE QLF08